zeranemesis/Marioparty4/partyboard/src/REL/m453Dll/main.c
#include "ext_math.h"
#include "game/audio.h"
#include "game/chrman.h"
#include "game/disp.h"
#include "game/flag.h"
#include "game/frand.h"
#include "game/gamework.h"
#include "game/hu3d.h"
#include "game/memory.h"
#include "game/minigame_seq.h"
#include "game/objsub.h"
#include "game/pad.h"
#include "game/sprite.h"
#include "game/wipe.h"

#include "string.h"

#include "REL/m453Dll.h"
#include "version.h"

typedef struct M453DllWork {
    /* 0x00 */ u8 unk_00;
    /* 0x04 */ Vec unk_04;
    /* 0x10 */ Vec unk_10;
    /* 0x1C */ Vec unk_1C;
    /* 0x28 */ Vec unk_28;
    /* 0x34 */ Vec unk_34;
    /* 0x40 */ Vec unk_40;
    /* 0x4C */ Vec unk_4C;
    /* 0x58 */ Vec unk_58;
    /* 0x64 */ Vec unk_64[3];
    /* 0x88 */ Vec unk_88[3];
    /* 0xAC */ Vec unk_AC[3];
    /* 0xD0 */ Vec unk_D0[3];
    /* 0xF4 */ float unk_F4[3];
    /* 0x100 */ float unk_100[3];
    /* 0x10C */ float unk_10C[3];
    /* 0x118 */ float unk_118[3];
    /* 0x124 */ float unk_124[3];
    /* 0x130 */ float unk_130;
    /* 0x134 */ float unk_134;
    /* 0x138 */ float unk_138;
    /* 0x13C */ float unk_13C;
    /* 0x140 */ float unk_140;
    /* 0x144 */ float unk_144;
    /* 0x148 */ float unk_148;
} M453DllWork; /* size 0x14C */

typedef struct M453DllUnkStruct {
    s16 unk_00;
    s16 unk_02;
    float unk_04;
    float unk_08;
    char unk0C[0x34];
} M453DllUnkStruct; /* 0x40 */

typedef struct M453DllWork2 {
    u8 unk_00;
    u8 unk_01;
    u8 unk_02;
    u8 unk_03;
    u8 unk_04;
    u8 unk_05;
    u8 unk_06;
    u8 unk_07;
    char unk08[2];
    u8 unk_0A;
    char unk0B;
    u8 unk_0C;
    u8 unk_0D;
    u8 unk_0E;
    s16 unk_10;
    s16 unk_12;
    s16 unk_14;
    s16 unk_16;
    s16 unk_18;
    s16 unk_1A;
    float unk_1C;
    float unk_20;
    float unk_24;
    float unk_28;
    Vec unk_2C;
    Vec unk_38;
    float unk_44;
    float unk_48;
    float unk_4C;
    Vec unk_50;
    M453DllUnkStruct unk_5C;
    u8 unk_9C;
    s32 unk_A0;
} M453DllWork2; /* size 0xA4 */ // same as Unkm403Struct_01

void fn_1_440(omObjData *object);
void fn_1_460(omObjData *object);
void fn_1_848(omObjData *object);
void fn_1_FFC(omObjData *object);
void fn_1_105C(omObjData *object);
void fn_1_1248(omObjData *object);
void fn_1_14F8(omObjData *object);
void fn_1_15FC(omObjData *object);
void fn_1_1870(float arg8, Vec *arg0, Vec *arg1, float arg9);
void fn_1_1910(float arg8, Vec *arg0, Vec *arg1, float arg9, Vec *arg2, Vec *arg3, float argA);
void fn_1_1BF0(omObjData *object);
void fn_1_1FA0(omObjData *object);
void fn_1_20EC(omObjData *object);
void fn_1_23E0(omObjData *object);
void fn_1_2E24(omObjData *object);
s32 fn_1_36DC(void);
void fn_1_39C8(omObjData *object);
void fn_1_3C94(omObjData *object);
s16 fn_1_3E9C(s32 arg0, s16 arg1, HU3DPARTICLEHOOK);
void fn_1_3F38(HU3DMODEL *model, HU3DPARTICLE *particle, Mtx matrix);
s32 fn_1_43B8(void);
float fn_1_440C(float arg8, float arg9, float argA);
void fn_1_4E84(float *arg0, float *arg1, float *arg2, s32 arg3);
float fn_1_513C(float arg8, float *arg0, float *arg1, float *arg2, s32 arg3);
void fn_1_5290(float *arg0, float (*arg1)[3], float (*arg2)[3], s32 arg3);
void fn_1_5670(float arg8, float *arg0, float *arg1, float (*arg2)[3], float (*arg3)[3], s32 arg4);
float fn_1_5884(Vec *arg0);
s32 fn_1_63AC(void);
void fn_1_6448(void);

s16 lbl_1_data_0 = -1;

Vec lbl_1_data_4 = { 0.0f, 4000.0f, 4000.0f };

Vec lbl_1_data_10 = { 0.0f, -0.7f, -0.6f };

GXColor lbl_1_data_1C[0xA] = {
    { 0xFF, 0xFF, 0xFF, 0xFF },
    { 0, 0, 0, 0 },
    { 0x45, 0x7A, 0, 0 },
    { 0xC4, 0xFA, 0, 0 },
    { 0, 0, 0, 0 },
    { 0x3F, 0x80, 0, 0 },
    { 0, 0, 0, 0 },
    { 0, 0, 0, 0 },
    { 0, 0, 0, 0 },
    { 0, 0, 0, 0 },
};

omObjData *lbl_1_bss_58;
omObjData *lbl_1_bss_54;
omObjData *lbl_1_bss_50;
omObjData *lbl_1_bss_4C;
omObjData *lbl_1_bss_3C[4];
u16 lbl_1_bss_3A;
s16 lbl_1_bss_38;
s16 lbl_1_bss_36;
s16 lbl_1_bss_34;
s16 lbl_1_bss_32;
s16 lbl_1_bss_1E[0xA];
s16 lbl_1_bss_1C;
s16 lbl_1_bss_18[2];
s32 lbl_1_bss_14;
s32 lbl_1_bss_8[3];
s16 lbl_1_bss_2[3];
s16 lbl_1_bss_0;

void ObjectSetup(void)
{
    Process *var_r31;
    s32 var_r30;
    omObjData *var_r29;
    HU3DLIGHT *var_r28;
    s32 var_r27;
    s32 var_r26;

    OSReport("******* M453ObjectSetup *********\n");
    Hu3DLighInit();
    var_r26 = Hu3DGLightCreateV(&lbl_1_data_4, &lbl_1_data_10, lbl_1_data_1C);
    Hu3DGLightInfinitytSet(var_r26);
    var_r28 = Hu3DGlobalLight;
    var_r28->type |= 0x8000;
    var_r31 = omInitObjMan(0x32, 0x2000);
    var_r27 = frand() & 0x1F;
    for (var_r30 = 0; var_r30 < var_r27; var_r30++) {
        fn_1_43B8();
    }
    CRot.x = -23.5f;
    CRot.y = 0.0f;
    CRot.z = 0.0f;
    Center.x = 0.0f;
    Center.y = 320.0f;
    Center.z = 147.0f;
    CZoom = 1720.0f;
    Hu3DCameraCreate(1);
    Hu3DCameraPerspectiveSet(1, 45.0f, 400.0f, 10000.0f, 1.2f);
    Hu3DCameraViewportSet(1, 0.0f, 0.0f, HU_FB_WIDTHF, HU_FB_HEIGHTF, 0.0f, 1.0f);
    lbl_1_bss_54 = omAddObjEx(var_r31, 0x7FDA, 0, 0, -1, omOutView);
    lbl_1_bss_58 = omAddObjEx(var_r31, 0x10, 8, 0, -1, fn_1_440);
    lbl_1_bss_4C = omAddObjEx(var_r31, 0x20, 0x10, 0, -1, fn_1_105C);
    lbl_1_bss_50 = omAddObjEx(var_r31, 0x50, 0x10, 0, -1, fn_1_14F8);
    omAddObjEx(var_r31, 0x60, 0, 0, -1, fn_1_39C8);
    fn_1_64E8(var_r31);
    fn_1_7C2C(3);
    omMakeGroupEx(var_r31, 0, 4);
    omGetGroupMemberListEx(var_r31, 0);
    for (var_r30 = 0; var_r30 < 4; var_r30++) {
        var_r29 = omAddObjEx(var_r31, 0x30, 2, 8, 0, fn_1_1BF0);
        lbl_1_bss_3C[var_r30] = var_r29;
        var_r29->work[0] = var_r30;
        var_r29->work[1] = var_r30;
    }
    omGameSysInit(var_r31);
    WipeCreate(WIPE_MODE_IN, WIPE_TYPE_NORMAL, 60);
    HuAudSndGrpSet(0x1C);
    lbl_1_bss_2[0] = 1;
    if (GWMGRecordGet(9) == 0) {
        GWMGRecordSet(9, 0);
    }
    fn_1_8F48(var_r31, GWMGRecordGet(9));
    fn_1_924C(0);
}

void fn_1_440(omObjData *object)
{
    lbl_1_bss_3A = 0;
    object->func = fn_1_460;
}

void fn_1_460(omObjData *object)
{
    Vec sp2C;
    Vec sp20;
    Vec sp14;
    Vec sp8;

    float var_f31;
    float var_f30;

    switch (lbl_1_bss_3A) {
        case 0:
            sp2C.x = 0.0f;
            sp2C.y = 0.0f;
            sp2C.z = -50.0f;
            sp20.x = -90.0f;
            sp20.y = 90.0f;
            sp20.z = 0.0f;
            var_f31 = 2200.0f;
            fn_1_1870(1.0f, &sp2C, &sp20, var_f31);
            lbl_1_bss_32 = REFRESH_RATE;
            lbl_1_bss_3A += 1;
            break;
        case 1:
            if (--lbl_1_bss_32 == 0) {
                lbl_1_bss_3A += 1;
            }
            break;
        case 2:
            if (lbl_1_bss_32 == 0) {
                fn_1_7C3C();
                lbl_1_bss_32 = REFRESH_RATE * 1.5;
                sp2C.x = 200.0f;
                sp2C.y = 100.0f;
                sp2C.z = -50.0f;
                sp20.x = -50.0f;
                sp20.y = 90.0f;
                sp20.z = 0.0f;
                var_f31 = 2000.0f;
                sp14.x = 0.0f;
                sp14.y = 320.0f;
                sp14.z = 147.0f;
                sp8.x = -23.5f;
                sp8.y = 0.0f;
                sp8.z = 0.0f;
                var_f30 = 1720.0f;
                fn_1_1910(REFRESH_RATE_F * 3, &sp14, &sp8, var_f30, &sp2C, &sp20, var_f31);
            }
            if (--lbl_1_bss_32 == 0) {
                lbl_1_bss_3A += 1;
            }
            break;
        case 3:
            if (lbl_1_bss_32 == 0) {
                lbl_1_bss_32 = REFRESH_RATE * 1.5;
            }
            if (--lbl_1_bss_32 == 0) {
                lbl_1_bss_3A += 1;
            }
            break;
        case 4:
            lbl_1_bss_3A = 5;
            lbl_1_bss_38 = lbl_1_bss_36 = -1;
            object->func = fn_1_848;
            HuSprAnimRead(HuDataReadNum(DATA_MAKE_NUM(DATADIR_M403, 19), 0x10000000));
            break;
    }
    if ((omSysExitReq != 0) && (WipeStatGet() == 0)) {
        WipeCreate(WIPE_MODE_OUT, WIPE_TYPE_NORMAL, 60);
        object->func = fn_1_FFC;
    }
}

s32 lbl_1_data_68[9] = {
    -1,
    0x610000,
    0x610001,
    0x610002,
    0x610003,
    0x610004,
    0x610005,
    0x610006,
    0x610007,
};

