zeranemesis/Marioparty4/partyboard/src/REL/m453Dll/main.c
void fn_1_848(omObjData *object)
{
    Vec sp1C;
    Vec sp10;
    s16 sp8[4];
    float var_f31;

    s32 var_r31;
    s32 var_r30;
    s32 var_r28;

    switch (lbl_1_bss_3A) {
        case 5:
            if (lbl_1_bss_36 == -1) {
                lbl_1_bss_34 = REFRESH_RATE * 30;
                lbl_1_bss_36 = MGSeqCreate(3, 0);
                MGSeqPosSet(lbl_1_bss_36, 320.0f, 240.0f);
            }
            else if (MGSeqStatGet(lbl_1_bss_36) == 0) {
                lbl_1_bss_36 = -1;
                lbl_1_bss_3A += 1;
                lbl_1_bss_32 = 0;
                lbl_1_data_0 = 4;
            }
            if ((lbl_1_data_68[0] == -1) && ((MGSeqStatGet(lbl_1_bss_36) & 0x10) != 0)) {
                lbl_1_data_68[0] = HuAudSeqPlay(0x48);
            }
            break;
        case 6:
            var_r30 = 0;
            if ((lbl_1_data_0 == 0) && (fn_1_8240() == 0)) {
                var_r30++;
            }
            if (var_r30 != 0) {
                lbl_1_bss_3A += 1;
            }
            break;
        case 7:
            if (lbl_1_bss_36 == -1) {
                lbl_1_bss_36 = MGSeqCreate(3, 1);
                MGSeqPosSet(lbl_1_bss_36, 320.0f, 240.0f);
                MGSeqKill(lbl_1_bss_38);
                HuAudSeqFadeOut(lbl_1_data_68[0], 0x64);
            }
            else if (MGSeqStatGet(lbl_1_bss_36) == 0) {
                lbl_1_bss_36 = -1;
                if (lbl_1_bss_2[0] == 0) {
                    if (lbl_1_data_0 != 0) {
                        for (var_r31 = 0; var_r31 < 4; var_r31++) {
                            if (((M453DllWork2 *)lbl_1_bss_3C[var_r31]->data)->unk_07 != 0) {
                                break;
                            }
                        }
                        sp1C.x = lbl_1_bss_3C[var_r31]->trans.x;
                        sp1C.y = 100.0f;
                        sp1C.z = lbl_1_bss_3C[var_r31]->trans.z;
                        sp10.x = -18.0f;
                        sp10.y = 0.0f;
                        sp10.z = 0.0f;
                        var_f31 = 600.0f;
                        fn_1_1870(REFRESH_RATE_F * 0.75f, &sp1C, &sp10, var_f31);
                    }
                    lbl_1_bss_3A = 9;
                    lbl_1_bss_32 = REFRESH_RATE * 1.5;
                }
                else {
                    if ((lbl_1_bss_14 != 0) && (lbl_1_bss_0 >= 0xF)) {
                        GWGameStat.present[0x31] = 1;
                    }
                    if ((lbl_1_bss_14 != 0) && ((s32)GWMGRecordGet(9) < lbl_1_bss_0)) {
                        GWMGRecordSet(9, lbl_1_bss_0);
                        lbl_1_bss_3A = 8;
                        fn_1_924C(1);
                    }
                    else {
                        lbl_1_bss_36 = -1;
                        lbl_1_bss_3A = 9;
                        lbl_1_bss_32 = REFRESH_RATE * 1.5;
                    }
                    fn_1_6448();
                }
            }
            break;
        case 8:
            if (lbl_1_bss_36 == -1) {
                lbl_1_bss_36 = MGSeqCreate(0xE, lbl_1_bss_0);
            }
            else if (MGSeqStatGet(lbl_1_bss_36) == 0) {
                lbl_1_bss_36 = -1;
                lbl_1_bss_32 = REFRESH_RATE * 1.5;
                lbl_1_bss_3A = 9;
            }
            break;
        case 9:
            if (--lbl_1_bss_32 == 0) {
                lbl_1_bss_3A += 1;
            }
            break;
        case 10:
            if (lbl_1_bss_2[0] == 0) {
                if (lbl_1_bss_36 == -1) {
                    if (lbl_1_data_0 == 0) {
                        lbl_1_bss_36 = MGSeqCreate(3, 2);
                        HuAudSStreamPlay(4);
                    }
                    else {
                        for (var_r31 = 0; var_r31 < 4; var_r31++) {
                            sp8[var_r31] = -1;
                        }
                        for (var_r31 = 0, var_r28 = 0; var_r31 < 4; var_r31++) {
                            if (((M453DllWork2 *)lbl_1_bss_3C[var_r31]->data)->unk_07 != 0) {
                                sp8[var_r28++] = GWPlayerCfg[var_r31].character;
                            }
                        }
                        lbl_1_bss_36 = MGSeqCreate(5, 3, sp8[0], sp8[1], sp8[2], sp8[3]);
                        HuAudSStreamPlay(1);
                    }
                }
                lbl_1_bss_36 = -1;
                lbl_1_bss_32 = REFRESH_RATE * 3.5;
                lbl_1_bss_3A += 1;
            }
            else {
                if (lbl_1_data_0 != 0) {
                    HuAudSStreamPlay(1);
                }
                else {
                    HuAudSStreamPlay(4);
                }
                lbl_1_bss_36 = -1;
                lbl_1_bss_32 = REFRESH_RATE * 3.5;
                lbl_1_bss_3A += 1;
            }
            break;
        case 11:
            if (--lbl_1_bss_32 == 0) {
                WipeCreate(WIPE_MODE_OUT, WIPE_TYPE_NORMAL, 60);
                object->func = fn_1_FFC;
            }
            break;
    }
    if ((omSysExitReq != 0) && (WipeStatGet() == 0)) {
        WipeCreate(WIPE_MODE_OUT, WIPE_TYPE_NORMAL, 60);
        object->func = fn_1_FFC;
    }
}

void fn_1_FFC(omObjData *object)
{
    if (WipeStatGet() == 0) {
        fn_1_6748();
        CharModelKill(-1);
        MGSeqKill(lbl_1_bss_38);
        MGSeqKillAll();
        HuAudFadeOut(1);
        omOvlReturnEx(1, 1);
    }
}

void fn_1_105C(omObjData *object)
{
    Hu3DLightAllKill();
    lbl_1_bss_18[0] = Hu3DGLightCreateV(&lbl_1_data_4, &lbl_1_data_10, lbl_1_data_1C);
    Hu3DGLightStaticSet(lbl_1_bss_18[0], 1);
    Hu3DGLightInfinitytSet(lbl_1_bss_18[0]);
    lbl_1_bss_18[1] = Hu3DGLightCreate(0.0f, 0.0f, 0.0f, 0.0f, 1.0f, 0.0f, 0, 0, 0);
    Hu3DGLightStaticSet(lbl_1_bss_18[1], 1);
    Hu3DGLightPointSet(lbl_1_bss_18[1], 0.0f, 0.0f, 3);
    Hu3DGLightColorSet(lbl_1_bss_18[0], 0, 0, 0, 0xFF);
    Hu3DGLightPosSet(lbl_1_bss_18[1], -1470.0f, 800.0f, -2000.0f, 0.0f, -1.0f, 0.0f);
    Hu3DGLightColorSet(lbl_1_bss_18[1], 0, 0, 0, 0xFF);
    Hu3DGLightPointSet(lbl_1_bss_18[1], 1200.0f, 0.6f, 3);
    object->func = fn_1_1248;
}

void fn_1_1248(omObjData *object)
{
    s32 var_r30;

    s8 sp11[9] = { 0x01, 0x00, 0x02, 0x01, 0x00, 0x03, 0x02, 0x01, 0x00 };
    s8 sp8[9] = { 0x01, 0x01, 0x02, 0x02, 0x02, 0x03, 0x03, 0x03, 0x03 };

    switch (lbl_1_bss_3A) {
        case 0:
            break;
        case 1:
            Hu3DGLightColorSet(lbl_1_bss_18[0], 0xF0, 0xF0, 0xF0, 0xFF);
            break;
        case 3:
            Hu3DGLightColorSet(lbl_1_bss_18[1], 0xFF, 0xE0, 0xD0, 0xFF);
            break;
        case 5:
            object->work[0] = 0x1E;
            object->work[1] = 0x11;
            lbl_1_bss_8[0] = 1;
            break;
        case 6:
            if (fn_1_8240() == 0) {
                if (lbl_1_bss_8[0] == 0) {
                    lbl_1_bss_8[0] = REFRESH_RATE / 2;
                    lbl_1_bss_0++;
                    lbl_1_bss_14 = fn_1_63AC();
                    if (lbl_1_bss_0 == 0x63) {
                        lbl_1_bss_3A = 7;
                        return;
                    }
                }
                lbl_1_bss_8[0]--;
                if (lbl_1_bss_8[0] == 0) {
                    var_r30 = (object->work[1] - 2) >> 1;
                    if (var_r30 < 0) {
                        var_r30 = 0;
                    }
                    fn_1_864C(sp11[var_r30]);
                    fn_1_7C2C(sp8[var_r30]);
#if VERSION_PAL
                    fn_1_7C0C(0.02f * (object->work[0] * 0.6f));
#else
                    fn_1_7C0C(0.01f * object->work[0]);
#endif
                    object->work[0] += 5;
                    if (object->work[1] > 2) {
                        object->work[1] -= 1;
                    }
                }
            }
            break;
    }
}

void fn_1_14F8(omObjData *object)
{
    M453DllWork *var_r31 = HuMemDirectMallocNum(HEAP_SYSTEM, sizeof(M453DllWork), MEMORY_DEFAULT_NUM);
    object->data = var_r31;
    var_r31->unk_148 = var_r31->unk_144 = 0.0f;
    var_r31->unk_140 = 1.0f;
    var_r31->unk_10.x = var_r31->unk_28.x = -23.5f;
    var_r31->unk_10.y = var_r31->unk_28.y = 0.0f;
    var_r31->unk_10.z = var_r31->unk_28.z = 0.0f;
    var_r31->unk_04.x = var_r31->unk_1C.x = 0.0f;
    var_r31->unk_04.y = var_r31->unk_1C.y = 320.0f;
    var_r31->unk_04.z = var_r31->unk_1C.z = 147.0f;
    var_r31->unk_130 = var_r31->unk_134 = 1720.0f;
    object->func = fn_1_15FC;
}

void fn_1_15FC(omObjData *object)
{
    float var_f31;
    M453DllWork *var_r31 = object->data;

    if (var_r31->unk_148 > 0.0f) {
        var_r31->unk_148 = var_r31->unk_148 - var_r31->unk_140;
        var_f31 = (var_r31->unk_144 - var_r31->unk_148) / var_r31->unk_144;
        var_f31 = sind((90.0f * var_f31));
        if (var_r31->unk_00 == 0) {
            var_r31->unk_04.x = var_r31->unk_1C.x + (var_f31 * (var_r31->unk_34.x - var_r31->unk_1C.x));
            var_r31->unk_04.y = var_r31->unk_1C.y + (var_f31 * (var_r31->unk_34.y - var_r31->unk_1C.y));
            var_r31->unk_04.z = var_r31->unk_1C.z + (var_f31 * (var_r31->unk_34.z - var_r31->unk_1C.z));
            var_r31->unk_10.x = var_r31->unk_28.x + (var_f31 * (var_r31->unk_40.x - var_r31->unk_28.x));
            var_r31->unk_10.y = var_r31->unk_28.y + (var_f31 * (var_r31->unk_40.y - var_r31->unk_28.y));
            var_r31->unk_10.z = var_r31->unk_28.z + (var_f31 * (var_r31->unk_40.z - var_r31->unk_28.z));
            var_r31->unk_130 = var_r31->unk_134 + (var_f31 * (var_r31->unk_138 - var_r31->unk_134));
        }
        else {
            fn_1_5670(2.0f * var_f31, (float *)&var_r31->unk_04, var_r31->unk_F4, (float(*)[3])var_r31->unk_64, (float(*)[3])var_r31->unk_88, 3);
            fn_1_5670(2.0f * var_f31, (float *)&var_r31->unk_10, var_r31->unk_100, (float(*)[3])var_r31->unk_AC, (float(*)[3])var_r31->unk_D0, 3);
            var_r31->unk_130 = fn_1_513C(2.0f * var_f31, var_r31->unk_124, var_r31->unk_10C, var_r31->unk_118, 3);
        }
    }
    CRot.x = var_r31->unk_10.x;
    CRot.y = var_r31->unk_10.y;
    CRot.z = var_r31->unk_10.z;
    Center.x = var_r31->unk_04.x;
    Center.y = var_r31->unk_04.y;
    Center.z = var_r31->unk_04.z;
    CZoom = var_r31->unk_130;
}

void fn_1_1870(float arg8, Vec *arg0, Vec *arg1, float arg9)
{
    M453DllWork *var_r31;

    var_r31 = lbl_1_bss_50->data;
    var_r31->unk_00 = 0;
    var_r31->unk_144 = arg8;
    var_r31->unk_148 = arg8;
    var_r31->unk_1C = var_r31->unk_04;
    var_r31->unk_34.x = arg0->x;
    var_r31->unk_34.y = arg0->y;
    var_r31->unk_34.z = arg0->z;
    var_r31->unk_28 = var_r31->unk_10;
    var_r31->unk_40.x = arg1->x;
    var_r31->unk_40.y = arg1->y;
    var_r31->unk_40.z = arg1->z;
    var_r31->unk_134 = var_r31->unk_130;
    var_r31->unk_138 = arg9;
}

void fn_1_1910(float arg8, Vec *arg0, Vec *arg1, float arg9, Vec *arg2, Vec *arg3, float argA)
{
    float var_f31;
    float var_f30;
    M453DllWork *var_r31 = lbl_1_bss_50->data;

    var_r31->unk_00 = 1;
    var_r31->unk_148 = var_r31->unk_144 = arg8;
    var_r31->unk_1C = var_r31->unk_04;
    var_r31->unk_34.x = arg0->x;
    var_r31->unk_34.y = arg0->y;
    var_r31->unk_34.z = arg0->z;
    var_r31->unk_4C.x = arg2->x;
    var_r31->unk_4C.y = arg2->y;
    var_r31->unk_4C.z = arg2->z;
    var_r31->unk_28 = var_r31->unk_10;
    var_r31->unk_40.x = arg1->x;
    var_r31->unk_40.y = arg1->y;
    var_r31->unk_40.z = arg1->z;
    var_r31->unk_58.x = arg3->x;
    var_r31->unk_58.y = arg3->y;
    var_r31->unk_58.z = arg3->z;
    var_r31->unk_134 = var_r31->unk_130;
    var_r31->unk_138 = arg9;
    var_r31->unk_13C = argA;
    var_r31->unk_64[0] = var_r31->unk_1C;
    var_r31->unk_64[1] = var_r31->unk_4C;
    var_r31->unk_64[2] = var_r31->unk_34;
    var_r31->unk_AC[0] = var_r31->unk_28;
    var_r31->unk_AC[1] = var_r31->unk_58;
    var_r31->unk_AC[2] = var_r31->unk_40;
    var_r31->unk_10C[0] = var_r31->unk_134;
    var_r31->unk_10C[1] = var_r31->unk_13C;
    var_r31->unk_10C[2] = var_r31->unk_138;
    var_r31->unk_124[0] = 0.0f;
    if ((var_r31->unk_10C[1] - var_r31->unk_10C[0]) < 0.0f) {
        var_f31 = -(var_r31->unk_10C[1] - var_r31->unk_10C[0]);
    }
    else {
        var_f31 = var_r31->unk_10C[1] - var_r31->unk_10C[0];
    }
    var_r31->unk_124[1] = var_f31;
    if ((var_r31->unk_10C[2] - var_r31->unk_10C[1]) < 0.0f) {
        var_f30 = -(var_r31->unk_10C[2] - var_r31->unk_10C[1]);
    }
    else {
        var_f30 = var_r31->unk_10C[2] - var_r31->unk_10C[1];
    }
    var_r31->unk_124[2] = var_r31->unk_124[1] + var_f30;
    fn_1_5290(var_r31->unk_F4, (float(*)[3])var_r31->unk_64, (float(*)[3])var_r31->unk_88, 3);
    fn_1_5290(var_r31->unk_100, (float(*)[3])var_r31->unk_AC, (float(*)[3])var_r31->unk_D0, 3);
    fn_1_4E84(var_r31->unk_124, var_r31->unk_10C, var_r31->unk_118, 3);
}

void fn_1_1BC8(float arg8)
{
    M453DllWork *var_r31 = lbl_1_bss_50->data;
    var_r31->unk_140 = arg8;
}

