zeranemesis/Marioparty4/partyboard/src/REL/m453Dll/main.c
s32 lbl_1_data_C4[8] = { 0, 2, 3, 8, 0xA, 9, 0x17, 0x18 };

Vec lbl_1_data_E4[4] = {
    { -300.0f, 2200.0f, 0.0f },
    { -100.0f, 2200.0f, 0.0f },
    { 100.0f, 2200.0f, 0.0f },
    { 300.0f, 2200.0f, 0.0f },
};

void fn_1_1BF0(omObjData *object)
{
    M453DllWork2 *var_r31;
    s32 var_r29;
    s32 var_r28;
    u32 var_r27;

    var_r31 = HuMemDirectMallocNum(HEAP_SYSTEM, sizeof(M453DllWork2), MEMORY_DEFAULT_NUM);
    object->data = var_r31;
    var_r31->unk_00 = object->work[0];
    var_r31->unk_01 = GWPlayerCfg[var_r31->unk_00].character;
    var_r31->unk_02 = var_r31->unk_00 >> 1;
    var_r31->unk_03 = var_r31->unk_00 & 1;
    var_r31->unk_04 = GWPlayerCfg[var_r31->unk_00].pad_idx;
    var_r31->unk_05 = GWPlayerCfg[var_r31->unk_00].iscom;
    var_r31->unk_06 = GWPlayerCfg[var_r31->unk_00].diff;
    var_r31->unk_18 = var_r31->unk_1A = 0;
    var_r31->unk_07 = 1;
    var_r31->unk_0C = 1;
    var_r31->unk_0D = 0;
    var_r31->unk_0E = 0;
    var_r31->unk_0A = 0;
    var_r31->unk_9C = 0;
    var_r27 = object->work[1];
    var_r31->unk_2C.x = lbl_1_data_E4[var_r27].x;
    var_r31->unk_2C.y = lbl_1_data_E4[var_r27].y + (100.0f * ((fn_1_43B8() - 0x8000) / 32768.0f));
    var_r31->unk_2C.z = lbl_1_data_E4[var_r27].z;
    var_r31->unk_44 = var_r31->unk_48 = var_r31->unk_4C = 0.0f;
    var_r31->unk_38.x = var_r31->unk_38.y = var_r31->unk_38.z = 0.0f;
    var_r31->unk_20 = var_r31->unk_38.y;
    var_r31->unk_24 = 0.0f;
    var_r31->unk_1C = 0.0f;
    var_r31->unk_28 = 1.0f;
    memset(&var_r31->unk_5C, 0, sizeof(M453DllUnkStruct));
    var_r31->unk_A0 = 1;
    if ((lbl_1_bss_2[0] != 0) && (var_r31->unk_05 == 0)) {
        lbl_1_bss_1E[lbl_1_bss_1C++] = var_r31->unk_00;
    }
    var_r28 = CharModelCreate(var_r31->unk_01, 4);
    object->model[0] = var_r28;
    Hu3DModelAttrSet(var_r28, HU3D_MOTATTR_LOOP);
    Hu3DModelShadowSet(var_r28);
    for (var_r29 = 0; var_r29 < 8; var_r29++) {
        object->motion[var_r29] = CharMotionCreate(var_r31->unk_01, lbl_1_data_C4[var_r29]);
    }
    CharMotionDataClose(var_r31->unk_01);
    CharMotionSet(var_r31->unk_01, object->motion[var_r31->unk_18]);
    omSetTra(object, var_r31->unk_2C.x, var_r31->unk_2C.y, var_r31->unk_2C.z);
    Hu3DModelPosSet(var_r28, var_r31->unk_2C.x, var_r31->unk_2C.y, var_r31->unk_2C.z);
    Hu3DModelRotSet(var_r28, 0.0f, 30.0f, 0.0f);
    CharModelStepFxSet(var_r31->unk_01, 1);
    CharMotionVoiceOnSet(var_r31->unk_01, object->motion[3], 0);
    object->func = fn_1_1FA0;
}

void fn_1_1FA0(omObjData *object)
{
    s32 sp8 = *object->model;
    M453DllWork2 *var_r31 = object->data;
    var_r31->unk_10 = var_r31->unk_12 = 0;
    var_r31->unk_14 = var_r31->unk_16 = 0;
    switch (lbl_1_bss_3A) {
        case 3:
            break;
        case 2:
            if (!(lbl_1_bss_32 < REFRESH_RATE_F)) {
                case 1:
                    var_r31->unk_18 = 3;
                    var_r31->unk_48 = 0.0f;
                    var_r31->unk_0C = 0;
            }
            break;
        case 5:
            object->func = fn_1_20EC;
            break;
    }
    if (var_r31->unk_2C.y < 10.0f) {
        omVibrate(var_r31->unk_00, 0xC, 6, 6);
        var_r31->unk_2C.y = 10.0f;
        var_r31->unk_0C = 1;
    }
    fn_1_2E24(object);
}

void fn_1_20EC(omObjData *object)
{
    M453DllWork2 *var_r31;
    s32 var_r29;
    s32 var_r28;

    var_r29 = object->model[0];
    var_r31 = object->data;
    if (var_r31->unk_07 != 0) {
        if ((lbl_1_bss_3A == 6) && ((var_r31->unk_07 & 2) == 0)) {
            if (var_r31->unk_05 != 0) {
                fn_1_23E0(object);
            }
            else {
                var_r31->unk_10 = HuPadStkX[var_r31->unk_04];
                var_r31->unk_12 = HuPadStkY[var_r31->unk_04];
                var_r31->unk_14 = HuPadBtnDown[var_r31->unk_04];
                var_r31->unk_16 = HuPadBtn[var_r31->unk_04];
            }
        }
        else {
            var_r31->unk_10 = var_r31->unk_12 = 0;
            var_r31->unk_14 = var_r31->unk_16 = 0;
        }
        switch (lbl_1_bss_3A) {
            case 5:
            case 6:
            case 8:
                break;
            case 7:
            case 9:
                object->scale.y += 0.2f * (1.0f - object->scale.y);
                var_r31->unk_38.y = fn_1_440C(var_r31->unk_38.y, 0.0f, 0.9f);
                break;
            case 10:
                if (var_r31->unk_18 != 6) {
                    var_r31->unk_18 = 6;
                }
                break;
        }
        if ((var_r31->unk_07 & 2) != 0) {
            var_r31->unk_10 = var_r31->unk_12 = 0;
            var_r31->unk_14 = var_r31->unk_16 = 0;
            if (object->scale.y < 0.2f) {
                omVibrate(var_r31->unk_00, 0xC, 4, 2);
                HuAudFXPlay(0x523);
                var_r31->unk_07 = 0;
                Hu3DModelShadowReset(var_r29);
                Hu3DModelAttrSet(var_r29, HU3D_ATTR_DISPOFF);
                lbl_1_data_0--;
                var_r28 = fn_1_3E9C(0x220013, 0x64, fn_1_3F38);
                Hu3DModelPosSet(var_r28, var_r31->unk_2C.x, var_r31->unk_2C.y, var_r31->unk_2C.z);
                Hu3DModelLayerSet(var_r28, 2);
            }
        }
        if (fn_1_8240() != 0) {
            var_r31->unk_A0 = 0;
        }
        else if (((var_r31->unk_07 & 2) == 0) && (var_r31->unk_A0 == 0)) {
            omVibrate(var_r31->unk_00, 0xC, 6, 6);
            var_r31->unk_A0 = 1;
        }
        fn_1_2E24(object);
    }
}

void fn_1_23E0(omObjData *object)
{
    Vec sp38[6];
    float sp20[6];
    Vec sp14;
    Vec sp8;

    float var_f31;
    float var_f30;
    float var_f29;
    float var_f28;

    M453DllWork2 *var_r31;
    s32 var_r30;
    s32 var_r29;
    s16 var_r28;
    s16 var_r27;
    s16 var_r26;
    s32 var_r25;
    s32 var_r24;
    s32 var_r23;
    s32 var_r22;
    s16 var_r21;
    s16 var_r20;

    var_r22 = 0;
    var_r30 = 0;
    var_r29 = 0;
    for (; var_r30 < 4; var_r30++) {
        var_r31 = lbl_1_bss_3C[var_r30]->data;
        if ((var_r31->unk_05 == 0) && (var_r31->unk_07 != 0)) {
            break;
        }
    }
    var_r31 = object->data;
    if ((var_r30 >= 4) && (var_r31->unk_9C == 0)) {
        var_r22 = 1;
    }
    var_r28 = var_r31->unk_06;
    var_r27 = var_r26 = var_r21 = var_r20 = 0;
    switch (var_r31->unk_5C.unk_00) {
        case 0:
            if (fn_1_8240() != 0) {
                var_r31->unk_5C.unk_00 = 1;
            }
            break;
        case 1:
            var_r31->unk_5C.unk_00 = 2;
            var_r31->unk_5C.unk_02 = (s32)(REFRESH_RATE_F * (1.2f - (0.2f * var_r28)) * (fn_1_43B8() / 65536.0f));
            var_r31->unk_5C.unk_04 = 500.0f * ((fn_1_43B8() - 0x8000) / 32768.0f);
            var_r31->unk_5C.unk_08 = 200.0f * ((fn_1_43B8() - 0x8000) / 32768.0f);
            var_r27 = var_r31->unk_10;
            var_r26 = var_r31->unk_12;
            break;
        case 2:
            sp8.x = var_r31->unk_5C.unk_04 - var_r31->unk_2C.x;
            sp8.y = 0.0f;
            sp8.z = var_r31->unk_5C.unk_08 - var_r31->unk_2C.z;
            var_f31 = fn_1_5884(&sp8);
            if (var_f31 < 20.0f) {
                var_r31->unk_5C.unk_00 = 3;
            }
            else {
                if (var_f31 >= 100.0f) {
                    var_f28 = 0.8f;
                }
                else {
                    var_f28 = 0.4f;
                }
                var_f30 = fn_1_440C(var_r31->unk_38.y, atan2d(sp8.x, sp8.z), var_f28);
                var_f29 = 48.0f + (4.0f * var_r28);
                var_r27 = var_f29 * sind(var_f30);
                var_r26 = var_f29 * -cosd(var_f30);
                if (fn_1_8240() == 0) {
                    var_r31->unk_5C.unk_00 = 0;
                    if (var_r31->unk_5C.unk_02 == 0) {
                        var_r31->unk_5C.unk_02 = -1;
                    }
                }
                else if (var_r31->unk_5C.unk_02 >= 0) {
                    if (var_r31->unk_5C.unk_02 == 0) {
                        if ((var_f31 < 150.0f) && (var_r31->unk_0E != 0)) {
                            var_r31->unk_5C.unk_00 = 3;
                        }
                        else if (((s32)((var_r28 + 2) * (fn_1_43B8() / 65536.0f)) != 0) && (var_r22 == 0)) {
                            var_r31->unk_5C.unk_00 = 4;
                        }
                        else {
                            var_r31->unk_5C.unk_00 = 1;
                        }
                    }
                    else {
                        var_r31->unk_5C.unk_02--;
                    }
                }
            }
            break;
        case 3:
            sp8.x = var_r31->unk_5C.unk_04 - var_r31->unk_2C.x;
            sp8.y = 0.0f;
            sp8.z = var_r31->unk_5C.unk_08 - var_r31->unk_2C.z;
            if ((fn_1_5884(&sp8) >= 30.000002f) && (var_r31->unk_0E == 0)) {
                var_r31->unk_5C.unk_00 = 2;
            }
            else if (fn_1_8240() == 0) {
                var_r31->unk_5C.unk_00 = 0;
            }
            else {
                if (var_r31->unk_5C.unk_02 > 0) {
                    var_r31->unk_5C.unk_02--;
                }
                if (var_r31->unk_5C.unk_02 == 0) {
                    if (((s32)((var_r28 + 2) * (fn_1_43B8() / 65536.0f)) != 0) && (var_r22 == 0)) {
                        var_r31->unk_5C.unk_00 = 4;
                    }
                    else {
                        var_r31->unk_5C.unk_00 = 1;
                    }
                }
            }
            break;
        case 4:
            var_r24 = fn_1_82AC(sp38);
            for (var_r30 = 0; var_r30 < var_r24; var_r30++) {
                VECSubtract(&sp38[var_r30], &var_r31->unk_2C, &sp8);
                sp20[var_r30] = VECMag(&sp8);
            }
            for (var_r30 = 0; var_r30 < (var_r24 - 1); var_r30++) {
                for (var_r29 = var_r30 + 1; var_r29 < var_r24; var_r29++) {
                    if (sp20[var_r30] > sp20[var_r29]) {
                        sp14 = sp38[var_r30];
                        sp38[var_r30] = sp38[var_r29];
                        sp38[var_r29] = sp14;
                        var_f31 = sp20[var_r30];
                        sp20[var_r30] = sp20[var_r29];
                        sp20[var_r29] = var_f31;
                    }
                }
            }
            var_r25 = 0x3E8;
            var_r23 = var_r25 * (fn_1_43B8() / 65536.0f);
            for (var_r30 = 0; var_r30 < (var_r24 - 1); var_r30++) {
                var_r25 = 0.1f * (var_r25 * (5.0f + var_r28));
                var_r23 -= var_r25;
                if (var_r23 < 0) {
                    break;
                }
            }
            var_r31->unk_5C.unk_04 = sp38[var_r30].x + (100.0f * (0.5f - (0.15f * var_r28)) * ((fn_1_43B8() - 0x8000) / 32768.0f));
            var_r31->unk_5C.unk_08 = sp38[var_r30].z + (100.0f * (0.5f - (0.15f * var_r28)) * ((fn_1_43B8() - 0x8000) / 32768.0f));
            var_r31->unk_5C.unk_00 = 2;
            var_r31->unk_5C.unk_02 = -1;
            var_r27 = var_r31->unk_10;
            var_r26 = var_r31->unk_12;
            break;
    }
    var_r31->unk_10 = var_r27;
    var_r31->unk_12 = var_r26;
    var_r31->unk_14 = var_r21;
    var_r31->unk_16 = var_r20;
}

void fn_1_2E24(omObjData *object)
{
    s16 spA;
    s16 sp8;
    float var_f29;

