zeranemesis/Marioparty4/partyboard/src/REL/m453Dll/main.c
    M453DllWork2 *var_r31;
    s16 var_r30;
    s16 var_r29;
    s16 var_r28;
    s16 var_r27;
    s32 var_r25;

    var_r31 = object->data;
    var_r25 = object->model[0];
    var_r28 = var_r31->unk_18;
    var_r31->unk_50 = var_r31->unk_2C;
    var_r30 = var_r31->unk_10;
    var_r29 = var_r31->unk_12;
    spA = var_r31->unk_14;
    sp8 = var_r31->unk_16;
    switch (var_r31->unk_18) {
        case 0:
        case 1:
        case 2:
            var_r31->unk_1C = 0.14f * sqrtf((var_r30 * var_r30) + (var_r29 * var_r29));
            if (var_r31->unk_1C > 0.1f) {
                if (var_r31->unk_1C >= 6.0f) {
                    var_r28 = 2;
                    var_r27 = 1;
                }
                else {
                    var_r28 = 1;
                    var_r27 = 1;
                }
                var_f29 = atan2d(var_r30, -var_r29);
                var_r31->unk_38.y = fn_1_440C(var_r31->unk_38.y, var_f29, 0.5f);
                var_r31->unk_20 = var_r31->unk_38.y;
                var_r31->unk_24 += 1.0f;
                if (var_r31->unk_24 >= (0.5f * var_r31->unk_28)) {
                    var_r31->unk_24 = var_r31->unk_24 - (0.5f * var_r31->unk_28);
                }
                var_r31->unk_1C = var_r31->unk_1C * (1.0 + (0.25 * cosd((90.0f * (var_r31->unk_24 / (0.5f * var_r31->unk_28))))));
            }
            else {
                var_r31->unk_24 = 0.0f;
                var_r31->unk_1C = 0.0f;
                var_r28 = 0;
                var_r27 = 1;
            }
            var_r31->unk_48 = -146.0f / REFRESH_RATE_F;
            break;
        case 3:
            var_r27 = 0;
            if ((Hu3DData[var_r25].motIdShift == -1) && (CharMotionEndCheck(var_r31->unk_01) != 0)) {
                var_r31->unk_48 += -146.0f / REFRESH_RATE_F;
            }
            else {
                var_r31->unk_48 = 0.0f;
            }
            if (var_r31->unk_0C != 0) {
                if (var_r31->unk_0D != 0) {
                    var_r31->unk_48 = 0.0f;
                    var_r31->unk_0D = 0;
                    var_r28 = 5;
                    var_r27 = 0;
                }
                else {
                    var_r31->unk_48 *= -0.1f;
                    var_r31->unk_0C = 0;
                    var_r28 = 4;
                    var_r27 = 0;
                }
            }
            break;
        case 4:
            var_r31->unk_48 += -146.0f / REFRESH_RATE_F;
            if ((var_r31->unk_0C != 0) && (CharMotionEndCheck(var_r31->unk_01) != 0)) {
                var_r28 = 5;
                var_r27 = 0;
            }
            break;
        case 5:
            if (CharMotionEndCheck(var_r31->unk_01) != 0) {
                var_r28 = 0;
                var_r27 = 1;
            }
            break;
        case 6:
        case 7:
            var_r27 = 0;
            var_r31->unk_48 = -146.0f / REFRESH_RATE_F;
            break;
    }
    if (var_r31->unk_07 & 4) {
        if (var_r31->unk_0A & 2) {
            Hu3DModelAttrSet(var_r25, HU3D_ATTR_DISPOFF);
        }
        else {
            Hu3DModelAttrReset(var_r25, HU3D_ATTR_DISPOFF);
        }
        if (--var_r31->unk_0A == 0) {
            var_r31->unk_07 = var_r31->unk_07 & 0xFFFFFFFB;
        }
    }
    var_r31->unk_44 = var_r31->unk_1C * sind(var_r31->unk_20);
    var_r31->unk_4C = var_r31->unk_1C * cosd(var_r31->unk_20);
    var_r31->unk_2C.x += var_r31->unk_44;
    if (var_r31->unk_0C == 0) {
        var_r31->unk_2C.y = var_r31->unk_2C.y + var_r31->unk_48;
    }
    var_r31->unk_2C.z += var_r31->unk_4C;
    if (var_r28 != var_r31->unk_1A) {
        var_r31->unk_1A = var_r28;
        var_r31->unk_18 = var_r28;
        CharMotionShiftSet(var_r31->unk_01, object->motion[var_r31->unk_18], 0.0f, 8.0f, var_r27);
        var_r31->unk_28 = CharMotionMaxTimeGet(var_r31->unk_01);
    }
    omSetTra(object, var_r31->unk_2C.x, var_r31->unk_2C.y, var_r31->unk_2C.z);
    omSetRot(object, var_r31->unk_38.x, var_r31->unk_38.y, var_r31->unk_38.z);
}

void fn_1_3648(void)
{
    s32 var_r31;
    M453DllWork2 *var_r30;
    s32 var_r29;

    var_r29 = 0;
    for (var_r31 = 0; var_r31 < 4; var_r31++) {
        var_r30 = lbl_1_bss_3C[var_r31]->data;
        if (var_r30->unk_07 != 0) {
            var_r30->unk_0E = 0;
        }
    }
    while ((fn_1_36DC() != 0) && (var_r29 < 0x32)) {
        var_r29++;
    }
}

s32 fn_1_36DC(void)
{
    Vec sp14[4];
    Vec sp8;
    float var_f30;
    float var_f31;

    M453DllWork2 *var_r31;
    s32 var_r30;
    s32 var_r29;
    M453DllWork2 *var_r28;
    M453DllWork2 *var_r27;
    s32 var_r26;
    omObjData *var_r25;

    var_r26 = 0;
    for (var_r30 = 0; var_r30 < 4; var_r30++) {
        sp14[var_r30].x = sp14[var_r30].y = sp14[var_r30].z = 0.0f;
    }
    for (var_r30 = 0; var_r30 < 3; var_r30++) {
        var_r28 = lbl_1_bss_3C[var_r30]->data;
        if (var_r28->unk_07 != 0) {
            for (var_r29 = var_r30 + 1; var_r29 < 4; var_r29++) {
                var_r27 = lbl_1_bss_3C[var_r29]->data;
                if (var_r27->unk_07 != 0) {
                    VECSubtract(&var_r28->unk_2C, &var_r27->unk_2C, &sp8);
                    var_f31 = VECMag(&sp8);
                    if (var_f31 < 80.0f) {
                        VECNormalize(&sp8, &sp8);
                        var_f30 = 0.0001f + (0.5f * (80.0f - var_f31));
                        VECScale(&sp8, &sp8, var_f30);
                        VECAdd(&sp14[var_r30], &sp8, &sp14[var_r30]);
                        VECSubtract(&sp14[var_r29], &sp8, &sp14[var_r29]);
                        var_r28->unk_0E++;
                        var_r27->unk_0E++;
                        var_r26++;
                    }
                }
            }
        }
    }
    for (var_r30 = 0; var_r30 < 4; var_r30++) {
        var_r25 = lbl_1_bss_3C[var_r30];
        var_r31 = var_r25->data;
        if (var_r31->unk_07 != 0) {
            VECAdd(&var_r31->unk_2C, &sp14[var_r30], &var_r31->unk_2C);
            if (var_r31->unk_2C.x > 660.0f) {
                var_r31->unk_2C.x = 660.0f;
            }
            if (var_r31->unk_2C.x < -660.0f) {
                var_r31->unk_2C.x = -660.0f;
            }
            if (var_r31->unk_2C.z > 360.0f) {
                var_r31->unk_2C.z = 360.0f;
            }
            if (var_r31->unk_2C.z < -360.0f) {
                var_r31->unk_2C.z = -360.0f;
            }
            omSetTra(var_r25, var_r31->unk_2C.x, var_r31->unk_2C.y, var_r31->unk_2C.z);
        }
    }
    return var_r26;
}

void fn_1_39C8(omObjData *object)
{
    s32 sp8[4];

    s32 var_r31;
    s32 var_r30;
    M453DllWork2 *var_r29;
    s32 var_r28;
    s32 var_r27;

