zeranemesis/Marioparty4/partyboard/src/REL/m453Dll/main.c
    if (lbl_1_bss_3A >= 6) {
        if (fn_1_8240() != 0) {
            for (var_r31 = 0; var_r31 < 4; var_r31++) {
                fn_1_3C94(lbl_1_bss_3C[var_r31]);
            }
        }
        else {
            for (var_r31 = 0, var_r30 = 0; var_r31 < 4; var_r31++) {
                ((M453DllWork2 *)lbl_1_bss_3C[var_r31]->data)->unk_9C = 0;
                if (((M453DllWork2 *)lbl_1_bss_3C[var_r31]->data)->unk_07 != 0) {
                    sp8[var_r30++] = var_r31;
                }
            }
            if (var_r30 != 0) {
                var_r31 = sp8[(s32)(var_r30 * (fn_1_43B8() / 65536.0f))];
                ((M453DllWork2 *)lbl_1_bss_3C[var_r31]->data)->unk_9C = 1;
            }
        }
        var_r27 = 0;
        for (var_r28 = 0; var_r28 < 4; var_r28++) {
            var_r29 = lbl_1_bss_3C[var_r28]->data;
            if (var_r29->unk_07 != 0) {
                var_r29->unk_0E = 0;
            }
        }
        while ((fn_1_36DC() != 0) && (var_r27 < 0x32)) {
            var_r27++;
        }
    }
}

void fn_1_3BB4(Vec *arg0, Vec *arg1)
{
    Vec sp18[6];
    Vec spC;
    float var_f31;
    float var_f30;

    s32 var_r31;
    s32 var_r30;

    var_r30 = fn_1_844C(sp18);
    var_f31 = 2000.0f;
    for (var_r31 = 0; var_r31 < var_r30; var_r31++) {
        VECSubtract(&sp18[var_r31], arg0, &spC);
        var_f30 = VECMag(&spC);
        if (!(var_f30 >= var_f31)) {
            var_f31 = var_f30;
            *arg1 = sp18[var_r31];
        }
    }
}

float lbl_1_data_114[8] = { 40.0f, 40.0f, 40.0f, 40.0f, 40.0f, 100.0f, 40.0f, 80.0f };

float lbl_1_data_134[8] = { 160.0f, 160.0f, 180.0f, 160.0f, 160.0f, 180.0f, 180.0f, 200.0f };

void fn_1_3C94(omObjData *object)
{
    Vec sp8;
    float var_f31;
    float var_f30;

    M453DllWork2 *var_r31;
    s32 var_r29;
    s16 var_r28;

    var_r31 = object->data;
    if (var_r31->unk_07 != 0) {
        var_f30 = fn_1_80B0(&var_r31->unk_2C, lbl_1_data_114[var_r31->unk_01]) - 10.0f;
        if (var_f30 < 0.0f) {
            var_f30 = 0.0f;
        }
        if ((var_r31->unk_07 & 2) == 0) {
            var_f31 = 1.0f;
            if (var_f30 < lbl_1_data_134[var_r31->unk_01]) {
                if (fn_1_867C(&var_r31->unk_2C, &sp8) != 0) {
                    var_r31->unk_2C.x = sp8.x;
                    var_r31->unk_2C.z = sp8.z;
                }
                else {
                    if ((fn_1_7F54(var_r31->unk_2C.x, var_r31->unk_2C.z) - 10.0f) < 100.0f) {
                        var_r31->unk_07 = var_r31->unk_07 | 2;
                        var_r28 = lbl_1_bss_0;
                        var_r29 = var_r31->unk_00;
                        GWPlayerCoinWinSet(var_r29, var_r28);
                    }
                    var_f31 = var_f30 / lbl_1_data_134[var_r31->unk_01];
                }
            }
        }
        else {
            var_f31 = var_f30 / lbl_1_data_134[var_r31->unk_01];
        }
        if (object->scale.y < var_f31) {
            var_f31 = object->scale.y + (0.2f * (var_f31 - object->scale.y));
        }
        object->scale.y = var_f31;
    }
}

s16 fn_1_3E9C(s32 arg0, s16 arg1, HU3DPARTICLEHOOK arg2)
{
    HU3DPARTICLE *var_r31;
    s32 var_r30;
    ANIMDATA *var_r29;

    var_r29 = HuSprAnimRead(HuDataReadNum(arg0, 0x10000000));
    var_r30 = Hu3DParticleCreate(var_r29, arg1);
    Hu3DParticleHookSet(var_r30, arg2);
    var_r31 = Hu3DData[var_r30].hookData;
    var_r31->unk_2E = var_r30;
    var_r31->dataCnt = var_r31->emitCnt = 0;
    return var_r30;
}

void fn_1_3F38(HU3DMODEL *model, HU3DPARTICLE *particle, Mtx matrix)
{
    s16 sp8 = 0;
    float var_f31;
    float var_f30;
    float var_f29;

    HU3DPARTICLEDATA *var_r31;
    s32 var_r29;

    switch (particle->dataCnt) {
        case 0:
            var_f29 = 360.0f / particle->maxCnt;
            for (var_r31 = particle->data, var_r29 = 0; var_r29 < particle->maxCnt; var_r29++, var_r31++) {
                var_r31->vel.x = sind((var_f29 * var_r29)) * (1.0f + (0.1f * (6.0f * ((fn_1_43B8() - 0x8000) / 32768.0f))));
                var_r31->vel.y = 0.0f;
                var_r31->vel.z = cosd((var_f29 * var_r29)) * (1.0f + (0.1f * (6.0f * ((fn_1_43B8() - 0x8000) / 32768.0f))));
                var_r31->pos.x = 0.0f;
                var_r31->pos.y = 0.0f;
                var_r31->pos.z = 0.0f;
            }
            particle->emitCnt = REFRESH_RATE / 2;
            particle->dataCnt++;
        case 1:
            particle->emitCnt--;
            var_f31 = ((REFRESH_RATE_F / 2) - particle->emitCnt) / (REFRESH_RATE_F / 2);
            var_f30 = particle->emitCnt / (REFRESH_RATE_F / 2);
            for (var_r31 = particle->data, var_r29 = 0; var_r29 < particle->maxCnt; var_r29++, var_r31++) {
                var_r31->pos.x += 5.0f * var_f30 * var_r31->vel.x;
                var_r31->pos.y = 20.0f;
                var_r31->pos.z += 5.0f * var_f30 * var_r31->vel.z;
                var_r31->scale = 20.0f + (60.0f * var_f31);
                var_r31->color.r = var_r31->color.g = var_r31->color.b = 0xFF;
                var_r31->color.a = 64.0f * (1.0f - (var_f31 * var_f31));
            }
            if (particle->emitCnt == 0) {
                particle->dataCnt++;
            }
            break;
        case 2:
            Hu3DModelKill(particle->unk_2E);
            return;
    }
    DCFlushRange(particle->data, particle->maxCnt * sizeof(HU3DPARTICLEDATA));
}

u32 lbl_1_data_154 = 0x41C64E6D;

s32 fn_1_43B8(void)
{
    lbl_1_data_154 *= 0x41C64E6D;
    lbl_1_data_154 += 0x3039;
    return lbl_1_data_154 >> 0x10;
}

float fn_1_440C(float arg8, float arg9, float argA)
{
    float var_f31;

    if (arg8 > 180.0f) {
        arg8 -= 360.0f;
    }
    else if (arg8 <= -180.0f) {
        arg8 += 360.0f;
    }
    if (arg9 > 180.0f) {
        arg9 -= 360.0f;
    }
    else if (arg9 <= -180.0f) {
        arg9 += 360.0f;
    }
    var_f31 = arg8 - arg9;
    if (var_f31 > 180.0f) {
        var_f31 -= 360.0f;
    }
    else if (var_f31 <= -180.0f) {
        var_f31 += 360.0f;
    }
    arg8 = arg9 + (var_f31 * argA);
    if (arg8 > 180.0f) {
        return arg8 - 360.0f;
    }
    if (arg8 <= -180.0f) {
        arg8 += 360.0f;
    }
    return arg8;
}

void fn_1_4574(Mtx arg0, float arg8, float arg9, float argA)
{
    Mtx sp38;
    Mtx sp8;
    if (argA != 0.0f) {
        MTXRotRad(arg0, 0x5A, 0.017453292f * argA);
    }
    else {
        MTXIdentity(arg0);
    }
    if (arg8 != 0.0f) {
        MTXRotRad(sp38, 0x58, 0.017453292f * arg8);
        MTXConcat(sp38, arg0, arg0);
    }
    if (arg9 != 0.0f) {
        MTXRotRad(sp8, 0x59, 0.017453292f * arg9);
        MTXConcat(sp8, arg0, arg0);
    }
}
// TODO figue out type of arg0
void fn_1_4694(float *arg0, Vec *arg1)
{
    float var_f29;
    float var_f28;

