zeranemesis/Marioparty4/partyboard/src/REL/m453Dll/main.c
    arg1->x = atan2d(arg0[10], arg0[6]);
    arg1->z = atan2d(arg0[0], arg0[1]);
    var_f29 = -arg0[2];
    var_f28 = sqrtf((1.0 - (var_f29 * var_f29)) < 0.0 ? -(1.0 - (var_f29 * var_f29)) : 1.0 - (var_f29 * var_f29));
    if ((arg1->x > 90.0f) && (arg1->x < 270.0f) && (arg1->z > 90.0f) && (arg1->z < 270.0f)) {
        arg1->x = fmod(180.0f + arg1->x, 360.0);
        arg1->z = fmod(180.0f + arg1->z, 360.0);
        var_f28 = -var_f28;
    }
    arg1->y = atan2d(var_f28, var_f29);
}

float fn_1_49A0(float arg8, float arg9, float argA, float argB)
{
    float var_f31;
    float var_f30;

    var_f31 = 1.0 - arg8;
    var_f30 = (argB * (arg8 * arg8)) + ((arg9 * (var_f31 * var_f31)) + (2.0 * (argA * (var_f31 * arg8))));
    return var_f30;
}

void fn_1_4A18(float *arg0, float *arg1, float *arg2, float *arg3, float arg8)
{
    s32 i;

    for (i = 0; i < 3; i++) {
        *arg3 = fn_1_49A0(arg8, *arg0++, *arg1++, *arg2++);
        arg3++;
    }
}

float fn_1_4B34(float arg8, float arg9, float argA, float argB)
{
    float var_f31 = 2.0 * ((arg8 * argB) + (((arg8 - 1.0) * arg9) + ((1.0 - (2.0 * arg8)) * argA)));
    return var_f31;
}

void fn_1_4BAC(float *arg0, float *arg1, float *arg2, float *arg3, float arg8)
{
    float spC[3];
    float var_f30;
    float var_f29;

    s32 var_r31;

    for (var_r31 = 0; var_r31 < 3; var_r31++) {
        spC[var_r31] = fn_1_4B34(arg8, *arg0++, *arg1++, *arg2++);
    }

    var_f30 = (spC[2] * spC[2]) + ((spC[0] * spC[0]) + (spC[1] * spC[1]));
    var_f29 = sqrtf(var_f30);
    if (var_f29) {
        var_f29 = 1.0 / var_f29;
        for (var_r31 = 0; var_r31 < 3; var_r31++) {
            *arg3 = var_f29 * spC[var_r31];
            arg3++;
        }
        return;
    }
    *arg3++ = 0.0f;
    *arg3++ = 0.0f;
    *arg3++ = 1.0f;
}

void fn_1_4E84(float *arg0, float *arg1, float *arg2, s32 arg3)
{
    float sp48[16];
    float sp8[16];
    double var_f31;

    s32 var_r31;

    arg2[0] = 0.0f;
    arg2[arg3 - 1] = 0.0f;
    for (var_r31 = 0; var_r31 < (arg3 - 1); var_r31++) {
        sp48[var_r31] = arg0[var_r31 + 1] - arg0[var_r31];
        if (sp48[var_r31] == 0.0f) {
            sp8[var_r31 + 1] = 0.0f;
        }
        else {
            sp8[var_r31 + 1] = (arg1[var_r31 + 1] - arg1[var_r31]) / sp48[var_r31];
        }
    }
    arg2[1] = sp8[2] - sp8[1];
    sp8[1] = 2.0f * (arg0[2] - arg0[0]);
    for (var_r31 = 1; var_r31 < (arg3 - 2); var_r31++) {
        var_f31 = sp48[var_r31] / sp8[var_r31];
        arg2[var_r31 + 1] = (sp8[var_r31 + 2] - sp8[var_r31 + 1]) - (var_f31 * arg2[var_r31]);
        sp8[var_r31 + 1] = (2.0f * (arg0[var_r31 + 2] - arg0[var_r31])) - (var_f31 * sp48[var_r31]);
    }
    arg2[arg3 - 2] -= sp48[arg3 - 2] * arg2[arg3 - 1];
    for (var_r31 = arg3 - 2; var_r31 > 0; var_r31--) {
        if (sp8[var_r31] == 0.0f) {
            arg2[var_r31] = 0.0f;
        }
        else {
            arg2[var_r31] = (arg2[var_r31] - (sp48[var_r31] * arg2[var_r31 + 1])) / sp8[var_r31];
        }
    }
}

float fn_1_513C(float arg8, float *arg0, float *arg1, float *arg2, s32 arg3)
{
    float var_f31;
    float var_f30;
    float var_f29;

    s32 var_r31 = arg8;
    arg8 = arg8 - var_r31;
    var_f31 = arg0[var_r31 + 1] - arg0[var_r31];
    var_f30 = var_f31 * arg8;
    var_f29 = arg1[var_r31]
        + (var_f30
            * ((var_f30 * ((3.0f * arg2[var_r31]) + ((var_f30 * (arg2[var_r31 + 1] - arg2[var_r31])) / var_f31)))
                + (((arg1[var_r31 + 1] - arg1[var_r31]) / var_f31) - (var_f31 * ((2.0f * arg2[var_r31]) + arg2[var_r31 + 1])))));
    if (var_f31 == 0.0f) {
        var_f29 = arg1[var_r31];
    }
    return var_f29;
}

void fn_1_5290(float *arg0, float (*arg1)[3], float (*arg2)[3], s32 arg3)
{
    float spD4[16];
    float sp94[16];
    float sp54[16];
    float sp14[16];
    Vec sp8;
    double var_f31;

    s32 var_r31;
    s32 var_r30;
    s32 var_r27;

    arg0[0] = 0.0f;
    for (var_r30 = 1; var_r30 < arg3; var_r30++) {
        VECSubtract((Vec *)&arg1[var_r30], (Vec *)&arg1[var_r30 - 1], &sp8);
        arg0[var_r30] = arg0[var_r30 - 1] + VECMag(&sp8);
    }
    for (var_r27 = 0; var_r27 < 3; var_r27++) {
        for (var_r30 = 0; var_r30 < arg3; var_r30++) {
            spD4[var_r30] = arg1[var_r30][var_r27];
        }
        sp94[0] = 0.0f;
        sp94[arg3 - 1] = 0.0f;
        for (var_r31 = 0; var_r31 < (arg3 - 1); var_r31++) {
            sp14[var_r31] = arg0[var_r31 + 1] - arg0[var_r31];
            if (sp14[var_r31] == 0.0f) {
                sp54[var_r31 + 1] = 0.0f;
            }
            else {
                sp54[var_r31 + 1] = (spD4[var_r31 + 1] - spD4[var_r31]) / sp14[var_r31];
            }
        }
        sp94[1] = sp54[2] - sp54[1];
        sp54[1] = 2.0f * (arg0[2] - arg0[0]);
        for (var_r31 = 1; var_r31 < (arg3 - 2); var_r31++) {
            var_f31 = sp14[var_r31] / sp54[var_r31];
            sp94[var_r31 + 1] = (sp54[var_r31 + 2] - sp54[var_r31 + 1]) - (var_f31 * sp94[var_r31]);
            sp54[var_r31 + 1] = (2.0f * (arg0[var_r31 + 2] - arg0[var_r31])) - (var_f31 * sp14[var_r31]);
        }
        sp94[arg3 - 2] -= sp14[arg3 - 2] * sp94[arg3 - 1];
        for (var_r31 = arg3 - 2; var_r31 > 0; var_r31--) {
            if (sp54[var_r31] == 0.0f) {
                sp94[var_r31] = 0.0f;
            }
            else {
                sp94[var_r31] = (sp94[var_r31] - (sp14[var_r31] * sp94[var_r31 + 1])) / sp54[var_r31];
            }
        }
        for (var_r30 = 0; var_r30 < arg3; var_r30++) {
            arg2[var_r30][var_r27] = sp94[var_r30];
        }
    }
}

void fn_1_5670(float arg8, float *arg0, float *arg1, float (*arg2)[3], float (*arg3)[3], s32 arg4)
{
    float sp48[16];
    float sp8[16];

    s32 var_r30;
    s32 var_r29;

    for (var_r29 = 0; var_r29 < 3; var_r29++) {
        for (var_r30 = 0; var_r30 < arg4; var_r30++) {
            sp48[var_r30] = arg2[var_r30][var_r29];
            sp8[var_r30] = arg3[var_r30][var_r29];
        }
        arg0[var_r29] = fn_1_513C(arg8, arg1, sp48, sp8, 3);
    }
}

