zeranemesis/Marioparty4/partyboard/src/REL/m453Dll/main.c
float fn_1_5884(Vec *arg0)
{
    float sp8;
    float var_f30;
    float var_f29;

    var_f30 = (arg0->z * arg0->z) + ((arg0->x * arg0->x) + (arg0->y * arg0->y));
    var_f30 = sqrtf(var_f30);
    if (var_f30 != 0.0f) {
        var_f29 = 1.0f / var_f30;
        arg0->x *= var_f29;
        arg0->y *= var_f29;
        arg0->z *= var_f29;
    }
    else {
        arg0->x = arg0->y = arg0->z = 0.0f;
    }
    return var_f30;
}

float fn_1_5A1C(Vec arg0, Vec arg1, Vec *arg2, float arg8)
{
    if (arg8 <= 0.0f) {
        arg2->x = arg0.x;
        arg2->y = arg0.y;
        arg2->z = arg0.z;
        arg8 = 0.0f;
        return arg8;
    }
    if (arg8 >= 1.0f) {
        arg2->x = arg0.x + arg1.x;
        arg2->y = arg0.y + arg1.y;
        arg2->z = arg0.z + arg1.z;
        arg8 = 1.0f;
        return arg8;
    }
    arg2->x = arg0.x + (arg8 * arg1.x);
    arg2->y = arg0.y + (arg8 * arg1.y);
    arg2->z = arg0.z + (arg8 * arg1.z);
    return arg8;
}

float fn_1_5AF4(Vec arg0, Vec arg1, Vec arg2)
{
    float var_f31 = (arg2.z * (arg1.z - arg0.z)) + ((arg2.x * (arg1.x - arg0.x)) + (arg2.y * (arg1.y - arg0.y)));
    float var_f30 = -((arg2.z * arg2.z) + ((arg2.x * arg2.x) + (arg2.y * arg2.y)));
    if (var_f30 != 0.0f) {
        var_f31 /= var_f30;
    }
    return var_f31;
}

float fn_1_5BB0(Vec *arg0, Vec *arg1, Vec *arg2)
{
    Vec sp44;
    float var_f28;

    if (((arg2->z * arg2->z) + ((arg2->x * arg2->x) + (arg2->y * arg2->y))) == 0.0f) {
        return ((arg0->z - arg1->z) * (arg0->z - arg1->z))
            + (((arg0->x - arg1->x) * (arg0->x - arg1->x)) + ((arg0->y - arg1->y) * (arg0->y - arg1->y)));
    }
    var_f28 = fn_1_5AF4(*arg0, *arg1, *arg2);
    fn_1_5A1C(*arg1, *arg2, &sp44, var_f28);
    return ((arg0->z - sp44.z) * (arg0->z - sp44.z)) + (((arg0->x - sp44.x) * (arg0->x - sp44.x)) + ((arg0->y - sp44.y) * (arg0->y - sp44.y)));
}

float fn_1_5EEC(Vec *arg0, Vec *arg1, Vec *arg2, Vec *arg3, Vec *arg4)
{
    float var_f30;
    if (((arg2->z * arg2->z) + ((arg2->x * arg2->x) + (arg2->y * arg2->y))) == 0.0f) {
        return ((arg0->z - arg1->z) * (arg0->z - arg1->z))
            + (((arg0->x - arg1->x) * (arg0->x - arg1->x)) + ((arg0->y - arg1->y) * (arg0->y - arg1->y)));
    }
    var_f30 = fn_1_5AF4(*arg0, *arg1, *arg2);
    fn_1_5A1C(*arg1, *arg2, arg3, var_f30);

    arg4->x = arg3->x - arg0->x;
    arg4->y = arg3->y - arg0->y;
    arg4->z = arg3->z - arg0->z;

    return fn_1_5884(arg4);
}

s32 fn_1_639C(void)
{
    return lbl_1_bss_0;
}

s32 fn_1_63AC(void)
{
    s32 var_r31;
    omObjData **var_r30;
    M453DllWork2 *var_r29;

    var_r30 = omGetGroupMemberListEx(HuPrcCurrentGet(), 0);
    for (var_r31 = 0; var_r31 < lbl_1_bss_1C; var_r31++) {
        var_r29 = var_r30[lbl_1_bss_1E[var_r31]]->data;
        if (var_r29->unk_07 != 0) {
            return 1;
        }
    }
    return 0;
}

void fn_1_6448(void)
{
    s32 var_r31;
    M453DllWork2 *var_r30;
    omObjData **var_r29;
    s32 var_r28;
    s16 var_r27;

    var_r29 = omGetGroupMemberListEx(HuPrcCurrentGet(), 0);
    for (var_r31 = 0; var_r31 < 4; var_r31++) {
        var_r30 = var_r29[var_r31]->data;
        if (var_r30->unk_07 != 0) {
            var_r27 = lbl_1_bss_0;
            var_r28 = var_r30->unk_00;
            GWPlayerCoinWinSet(var_r28, var_r27);
        }
    }
}
